import matplotlib.pyplot as plt

# Новые данные
data = [
    2.00001E-07, 6.51716E-10, 2.32267E-12, 2.01505E-14, 7.21645E-15,
    1.66533E-15, 1.66533E-16, 2.77556E-16, 1E-20, 1.38778E-16,
    7.77156E-16, 3.60822E-16, 2.498E-16, 2.30371E-15, 2.77556E-15,
    3.88578E-16, 3.58047E-15, 1.38778E-14, 7.38298E-15, 2.24265E-14,
    3.45834E-14, 2.32037E-14, 4.62408E-14, 6.67522E-14, 1.03029E-13,
    9.76441E-14, 1.44051E-14, 1.47327E-13
]

# Создание логарифмического графика
plt.figure(figsize=(10, 6))
plt.plot(data, marker='o')
plt.yscale('log')
plt.title('Логарифмический график')
plt.xlabel('Индекс')
plt.ylabel('Значение')
plt.grid(True, which="both", ls="--")

# Показать график
plt.show()
