import matplotlib.pyplot as plt

# Данные
data = [
    0.455917708, 0.799374568, 0.10752283, 0.024593987, 0.006025902,
    0.001499082, 0.000374312, 9.35495E-05, 2.33856E-05, 5.84629E-06,
    1.46157E-06, 3.65391E-07, 9.13477E-08, 2.28369E-08, 5.70923E-09,
    1.42731E-09, 3.56828E-10, 8.92042E-11, 2.23021E-11, 5.57543E-12,
    1.39239E-12, 3.56493E-13, 5.51226E-14, 2.7478E-15, 4.54359E-14,
    1.21014E-14, 7.83262E-14, 5.45536E-13, 2.44166E-13, 5.62494E-13
]

# Создание логарифмического графика
plt.figure(figsize=(10, 6))
plt.plot(data, marker='o')
plt.yscale('log')
plt.title('Логарифмический график')
plt.xlabel('Индекс')
plt.ylabel('Значение')
plt.grid(True, which="both", ls="--")
plt.show()
